In [ ]:
""" Data wrangling with Python for the 5 data tables that are part of the database """

import pandas as pd

# importing the five CSVs

missing_values = ["-", "--", "n/a", "na", "NA", "N/A", "?", "None", "null", "NULL", ""] 

buyers = pd.read_csv(r"C:\Users\Desktop\Data Sets\(2)\buyers.csv", na_values=missing_values)
products = pd.read_csv(r"C:\Users\\Desktop\Data Sets\(2)\products.csv", na_values=missing_values)
reviews = pd.read_csv(r"C:\Users\\Desktop\Data Sets\(2)\reviews.csv", na_values=missing_values)
sellers = pd.read_csv(r"C:\Users\Desktop\Data Sets\(2)\sellers.csv", na_values=missing_values)
transactions = pd.read_csv(r"C:\Users\Desktop\Data Sets\(2)\transactions.csv", na_values=missing_values)

In [4]:
# Cleaning the BUYERS table

buyers.head()

   buyer_id             name gender   birthdate      country customer_type
0         1    Matthew Lucas      F  1948-08-22        Spain      régulier
1         2   Gerald Hensley      F  1961-06-09      Germany       nouveau
2         3    Joshua Taylor      M  1957-01-01        Italy           VIP
3         4    David Leblanc      M  1974-09-03  Netherlands      régulier
4         5  Savannah Garcia      M  1988-11-23      Belgium      régulier

In [5]:
buyers.tail()

      buyer_id             name gender   birthdate   country customer_type
2995      2996     Luis Watkins      F  1991-10-11    France      régulier
2996      2997    James Flowers      M  1961-09-14  Portugal       nouveau
2997      2998    Lindsay Olson      F  1971-10-25    France      régulier
2998      2999      Wesley Rich      F  1996-06-13   Germany      régulier
2999      3000  Tammy Rodriguez      M  1973-07-01     Spain      régulier

In [6]:
buyers.shape

(3000, 6)

In [7]:
buyers.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3000 entries, 0 to 2999
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   buyer_id       3000 non-null   int64
 1   name           3000 non-null   object
 2   gender         3000 non-null   object
 3   birthdate      3000 non-null   object
 4   country        3000 non-null   object
 5   customer_type  3000 non-null   object
dtypes: int64(1), object(5)
memory usage: 140.8+ KB

In [8]:
buyers.dtypes

buyer_id          int64
name             object
gender           object
birthdate        object
country          object
customer_type    object
dtype: object

In [9]:
buyers["birthdate"] = pd.to_datetime(buyers["birthdate"])
buyers["gender"] = buyers["gender"].astype("category")
buyers["country"] = buyers["country"].astype("category")
buyers["customer_type"] = buyers["customer_type"].astype("category")
buyers["buyer_id"] = buyers["buyer_id"].astype("object")

def clean_buyers(df):
    df["birthdate"] = pd.to_datetime(df["birthdate"])
    df["gender"] = df["gender"].astype("category")
    df["country"] = df["country"].astype("category")
    df["customer_type"] = df["customer_type"].astype("category")
    df["buyer_id"] = df["buyer_id"].astype("object")

In [10]:
for x in buyers.columns:
    value_count_buyers = buyers[x].value_counts()
    duplicated_buyers = value_count_buyers[value_count_buyers > 1]
    print(duplicated_buyers)

Series([], Name: count, dtype: int64)
name
Jeremy Martinez     4
Jamie Johnson       3
Matthew Wright      3
Michael Harris      3
Michael Taylor      3
                   ..
Mark Smith          2
Lindsey Thompson    2
Wendy Williams      2
John Johnson        2
John Lopez          2
Name: count, Length: 66, dtype: int64
gender
M    1510
F    1490
Name: count, dtype: int64
birthdate
1967-02-03    3
2005-06-15    3
1963-04-26    3
1958-08-12    3
1958-11-09    3
             ..
1985-12-10    2
1993-02-21    2
1962-04-06    2
1955-04-02    2
1999-06-10    2
Name: count, Length: 185, dtype: int64
country
Germany        759
France         647
Italy          443
Spain          433
Belgium        295
Portugal       199
Netherlands    142
Luxembourg      82
Name: count, dtype: int64
customer_type
régulier    1799
nouveau      912
VIP          289
Name: count, dtype: int64

In [11]:
buyers[buyers.duplicated(subset=["name"],keep=False)].sort_values(by=["name"])

# you can have an overview of every duplicate (inc the "original") by using keep=False
# you can find duplicates by subsets

     buyer_id             name gender  birthdate  country customer_type
337       338     Aaron Miller      M 1961-12-07    Italy      régulier
2939     2940     Aaron Miller      F 1948-01-26  Belgium      régulier
1662     1663       Adam Craig      F 1990-04-03  Belgium      régulier
1123     1124       Adam Craig      F 1970-05-03   France      régulier
2744     2745     Alison Brown      M 1997-02-28    Spain           VIP
...       ...              ...    ...        ...      ...           ...
489       490  Timothy Johnson      M 1972-05-04  Belgium           VIP
2478     2479   Wendy Williams      F 1988-05-01    Italy      régulier
2827     2828   Wendy Williams      M 1994-10-15  Germany      régulier
2530     2531      William Lee      M 1988-05-15  Germany      régulier
2365     2366      William Lee      M 1999-12-12  Germany      régulier

[140 rows x 6 columns]

In [12]:
buyers["birthdate"].sort_values() # Min: 1944 // Max: 2007

2176   1944-08-16
1345   1944-08-16
1980   1944-08-25
935    1944-08-31
2312   1944-09-01
          ...
2031   2007-05-29
945    2007-06-03
1497   2007-06-14
2515   2007-06-22
1298   2007-06-29
Name: birthdate, Length: 3000, dtype: datetime64[ns]

In [13]:
buyers["name"] = buyers["name"].str.title().str.strip()
buyers["country"] = buyers["country"].str.title().str.strip()
buyers["customer_type"] = buyers["customer_type"].str.lower().str.strip()

In [14]:
for col in buyers.columns:
    unique_vals = buyers[col].unique()
    print(unique_vals)

[1 2 3 ... 2998 2999 3000]
['Matthew Lucas' 'Gerald Hensley' 'Joshua Taylor' ... 'Lindsay Olson'
 'Wesley Rich' 'Tammy Rodriguez']
['F', 'M']
Categories (2, object): ['F', 'M']
<DatetimeArray>
['1948-08-22 00:00:00', '1961-06-09 00:00:00', '1957-01-01 00:00:00',
 '1974-09-03 00:00:00', '1988-11-23 00:00:00', '1955-11-01 00:00:00',
 '2005-12-05 00:00:00', '1962-07-25 00:00:00', '1991-12-02 00:00:00',
 '1993-05-28 00:00:00',
 ...
 '1952-05-12 00:00:00', '1976-04-24 00:00:00', '1984-07-22 00:00:00',
 '1968-12-09 00:00:00', '1968-11-17 00:00:00', '1945-12-30 00:00:00',
 '1991-10-11 00:00:00', '1961-09-14 00:00:00', '1971-10-25 00:00:00',
 '1973-07-01 00:00:00']
Length: 2809, dtype: datetime64[ns]
['Spain' 'Germany' 'Italy' 'Netherlands' 'Belgium' 'Luxembourg' 'France'
 'Portugal']
['régulier' 'nouveau' 'vip']

In [15]:
buyers["birthdate"] = pd.to_datetime(buyers["birthdate"], errors="coerce")
buyers[buyers["birthdate"].isnull()]

# If 'coerce', then invalid parsing will be set as NaT
# No errors were recorded when changing types

buyers["birthdate"].info()

<class 'pandas.core.series.Series'>
RangeIndex: 3000 entries, 0 to 2999
Series name: birthdate
Non-Null Count  Dtype
--------------  -----
3000 non-null   datetime64[ns]
dtypes: datetime64[ns](1)
memory usage: 23.6 KB

In [16]:
for col in buyers.columns:
    x = buyers[col].nunique()
    print(col, x)

buyer_id 3000
name 2926
gender 2
birthdate 2809
country 8
customer_type 3

In [17]:
# Cleaning the PRODUCTS table

products.head()

,book ID,name,price,category,summary,rating,seller_id
0,a897fe39b1053632,A Light in the Attic,51.77,Poetry,It's hard to imagine a world without A Light i...,Three,39
1,90fa61229261140a,Tipping the Velvet,53.74,Historical Fiction,"""Erotic and absorbing...Written with starling ...",One,29
2,6957f44c3847a760,Soumission,50.10,Fiction,"Dans une France assez proche de la nÃ´tre, un ...",One,15
3,f77dbf2323deb740,The Requiem Red,22.65,Young Adult,Patient Twenty-nine.A monster roams the halls ...,One,43
4,2597b5a345f45e1b,The Dirty Little Secrets of Getting Your Dream...,33.34,Business,Drawing on his extensive experience evaluating...,Four,8

In [18]:
products = products.rename(columns={"book ID": "book_id"})

In [19]:
products.tail()

,book_id,name,price,category,summary,rating,seller_id
8,0312262ecafa5a40,"Starving Hearts (Triangular Trade Trilogy, #1)",13.99,Default,"Since her assault, Miss Annette Chetwynd has b...",Two,23
9,30a7f60cd76ca58c,Shakespeare's Sonnets,20.66,Poetry,This book is an important and complete collect...,Four,11
10,ce6396b0f23f6ecc,Set Me Free,17.46,Young Adult,Aaron Ledbetterâs future had been planned ou...,Five,11
11,3b1c02bac2a429e6,Scott Pilgrim's Precious Little Life (Scott Pi...,52.29,Sequential Art,Scott Pilgrim's life is totally sweet. He's 23...,Five,24
12,a34ba96d4081e6a4,Rip it Up and Start Again,35.02,Music,"Punk's raw power rejuvenated rock, but by the ...",Five,36

In [20]:
products.shape

(13, 7)

In [21]:
products.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13 entries, 0 to 12
Data columns (total 7 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   book_id    13 non-null     object
 1   name       13 non-null     object
 2   price      13 non-null     float64
 3   category   13 non-null     object
 4   summary    13 non-null     object
 5   rating     13 non-null     object
 6   seller_id  13 non-null     int64
dtypes: float64(1), int64(1), object(5)
memory usage: 860.0+ bytes

In [22]:
products.describe()

           price  seller_id
count  13.000000  13.000000
mean   34.130769  24.461538
std    15.808240  11.857595
min    13.990000   8.000000
25%    20.660000  15.000000
50%    33.340000  23.000000
75%    51.770000  36.000000
max    53.740000  43.000000

In [23]:
products["category"] = products["category"].str.lower().str.strip()
products["rating"] = products["rating"].str.lower().str.strip()

In [24]:
products["category"] = products["category"].astype("category")
products["rating"] = products["rating"].astype("category")

In [25]:
products.dtypes

book_id        object
name           object
price         float64
category     category
summary        object
rating       category
seller_id       int64
dtype: object

In [26]:
for x in products.columns:
    value_count_products = products[x].value_counts()
    duplicated_products = value_count_products[value_count_products > 1]
    print(duplicated_products)

Series([], Name: count, dtype: int64)
Series([], Name: count, dtype: int64)
Series([], Name: count, dtype: int64)
category
default        3
poetry         3
young adult    2
Name: count, dtype: int64
Series([], Name: count, dtype: int64)
rating
one      4
five     3
four     3
three    2
Name: count, dtype: int64
seller_id
39    2
11    2
Name: count, dtype: int64

In [27]:
print(products["category"].value_counts(dropna=False))

category
default               3
poetry                3
young adult           2
business              1
historical fiction    1
fiction               1
music                 1
sequential art        1
Name: count, dtype: int64

In [28]:
print(products["rating"].value_counts(dropna=False))

rating
one      4
five     3
four     3
three    2
two      1
Name: count, dtype: int64

In [29]:
products[products["seller_id"] == 39]

,book_id,name,price,category,summary,rating,seller_id
0,a897fe39b1053632,A Light in the Attic,51.77,poetry,It's hard to imagine a world without A Light i...,three,39
6,e10e1e165dc8be4a,The Boys in the Boat: Nine Americans and Their...,22.60,default,For readers of Laura Hillenbrand's Seabiscuit ...,four,39

In [30]:
products["price"].sort_values()

8     13.99
10    17.46
5     17.93
9     20.66
6     22.60
3     22.65
4     33.34
12    35.02
2     50.10
0     51.77
7     52.15
11    52.29
1     53.74
Name: price, dtype: float64

In [31]:
products.head()

,book_id,name,price,category,summary,rating,seller_id
0,a897fe39b1053632,A Light in the Attic,51.77,poetry,It's hard to imagine a world without A Light i...,three,39
1,90fa61229261140a,Tipping the Velvet,53.74,historical fiction,"""Erotic and absorbing...Written with starling ...",one,29
2,6957f44c3847a760,Soumission,50.10,fiction,"Dans une France assez proche de la nÃ´tre, un ...",one,15
3,f77dbf2323deb740,The Requiem Red,22.65,young adult,Patient Twenty-nine.A monster roams the halls ...,one,43
4,2597b5a345f45e1b,The Dirty Little Secrets of Getting Your Dream...,33.34,business,Drawing on his extensive experience evaluating...,four,8

In [32]:
# Cleaning the REVIEWS table

reviews.head()

,review_id,book_id,review_text,rating,review_date,author
0,1,2597b5a345f45e1b,Change whether small trip another defense. C'é...,3,2022-10-13,James Shelton
1,2,1dfe412b8ac00530,Or thank others population admit why group. C'...,3,2019-06-29,Dean Cunningham
2,3,a897fe39b1053632,Without professor today family large appear se...,3,2018-05-19,Marvin Johnson
3,4,e10e1e165dc8be4a,Piece daughter head reach answer even fast wea...,4,2019-02-23,Kurt Williams
4,5,0312262ecafa5a40,Ever garden instead total husband trouble clos...,5,2024-06-02,Ethan Coleman

In [33]:
reviews.tail()

,review_id,book_id,review_text,rating,review_date,author
1168,1169,a34ba96d4081e6a4,Catch suddenly their natural build spring indi...,5,2023-04-08,Micheal Ramirez
1169,1170,f77dbf2323deb740,As thought far approach stand read collection ...,3,2019-01-15,Katie Campbell
1170,1171,e10e1e165dc8be4a,Serve use win quickly discussion politics. C'é...,3,2020-01-08,Kyle Vargas
1171,1172,e10e1e165dc8be4a,Successful no ground modern course world missi...,4,2019-06-13,Mary Gallegos
1172,1173,30a7f60cd76ca58c,Power middle speech four arm stop visit memory...,5,2017-11-22,Anthony King

In [34]:
reviews.shape

(1173, 6)

In [35]:
reviews.info()

# null values in review_text that need to be cleaned

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1173 entries, 0 to 1172
Data columns (total 6 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   review_id    1173 non-null   int64
 1   book_id      1173 non-null   object
 2   review_text  1167 non-null   object
 3   rating       1173 non-null   object
 4   review_date  1173 non-null   object
 5   author       1173 non-null   object
dtypes: int64(1), object(5)
memory usage: 55.1+ KB

In [36]:
reviews.dtypes

review_id       int64
book_id        object
review_text    object
rating         object
review_date    object
author         object
dtype: object

In [37]:
reviews["review_date"] = pd.to_datetime(reviews["review_date"], errors="coerce")
reviews["review_id"] = reviews["review_id"].astype("object")

# some values cannot be converted to integer, let's take care of these values first

reviews["rating"].unique()
reviews["rating"] = reviews["rating"].str.replace("Three", "3")
reviews["rating"] = reviews["rating"].str.replace("Bad", "1")
reviews["rating"].unique()

reviews["rating"] = reviews["rating"].astype(int)

reviews["review_date"].info()

<class 'pandas.core.series.Series'>
RangeIndex: 1173 entries, 0 to 1172
Series name: review_date
Non-Null Count  Dtype
--------------  -----
1173 non-null   datetime64[ns]
dtypes: datetime64[ns](1)
memory usage: 9.3 KB

In [38]:
for x in reviews.columns:
    print(x, reviews[x].isnull().sum())

review_id 0
book_id 0
review_text 6
rating 0
review_date 0
author 0

In [39]:
reviews[reviews["review_text"].isnull()]
reviews["review_text"] = reviews["review_text"].fillna("No review submitted")

In [40]:
for x in reviews.columns:
    value_count_reviews = reviews[x].value_counts()
    duplicated_reviews = value_count_reviews[value_count_reviews > 1]
    print(duplicated_reviews)

Series([], Name: count, dtype: int64)
book_id
e72a5dfc7e9267b2    112
1dfe412b8ac00530     97
a34ba96d4081e6a4     96
30a7f60cd76ca58c     94
ce6396b0f23f6ecc     92
e10e1e165dc8be4a     91
6957f44c3847a760     87
2597b5a345f45e1b     87
a897fe39b1053632     86
f77dbf2323deb740     85
3b1c02bac2a429e6     83
0312262ecafa5a40     82
90fa61229261140a     81
Name: count, dtype: int64
review_text
No review submitted           6
Incroyable, chef d'œuvre !    2
Name: count, dtype: int64
rating
4    348
3    312
5    246
2    169
1     98
Name: count, dtype: int64
review_date
2018-11-23    4
2018-03-11    3
2020-12-04    3
2024-08-03    3
2021-02-10    3
             ..
2023-05-08    2
2017-03-21    2
2020-06-20    2
2022-05-24    2
2019-06-29    2
Name: count, Length: 173, dtype: int64
author
Eric Johnson       3
Robert Johnson     2
Tony Johnson       2
Daniel Brown       2
Jennifer Taylor    2
Joshua Miller      2
Benjamin Brown     2
John Jones         2
John Reilly        2
Craig Tate         2
Jason Johnson      2
Kara Brown         2
Name: count, dtype: int64

In [41]:
reviews["book_id"].nunique() # 13
reviews["author"].nunique() # Too many authors generated by ChatGPT

1160

In [42]:
# Cleaning the SELLERS table

sellers.head()

   seller_id        author_name   birthdate      country  seller_type
0          1       Allison Hill  1959-09-15        Spain  Indépendant
1          2         Brian Yang  1981-08-18        Spain  Indépendant
2          3     Javier Johnson  1959-05-25      Germany  Marketplace
3          4      Lance Hoffman  1993-03-29       France  Marketplace
4          5  Kimberly Robinson  1984-08-13  Netherlands  Indépendant

In [43]:
sellers.tail()

    seller_id    author_name   birthdate      country       seller_type
45         46  Shannon Jones  1960-09-17  Netherlands  Maison d'édition
46         47      John Ryan  1993-09-28      Germany  Maison d'édition
47         48  Laura Kennedy  1997-11-28      Germany       Marketplace
48         49    Jason Davis  1989-05-12        Italy  Maison d'édition
49         50     Jeff Owens  1994-02-17       France       Marketplace

In [44]:
sellers.shape

(50, 5)

In [45]:
sellers.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50 entries, 0 to 49
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   seller_id    50 non-null     int64
 1   author_name  50 non-null     object
 2   birthdate    50 non-null     object
 3   country      50 non-null     object
 4   seller_type  50 non-null     object
dtypes: int64(1), object(4)
memory usage: 2.1+ KB

In [46]:
sellers.dtypes

seller_id       int64
author_name    object
birthdate      object
country        object
seller_type    object
dtype: object

In [47]:
sellers["author_name"] = sellers["author_name"].str.title().str.strip()
sellers["country"] = sellers["country"].str.title().str.strip()
sellers["seller_type"] = sellers["seller_type"].str.lower().str.strip()

In [48]:
sellers["seller_id"] = sellers["seller_id"].astype("object")
sellers["birthdate"] = pd.to_datetime(sellers["birthdate"], errors="coerce")
sellers["country"] = sellers["country"].astype("category")
sellers["seller_type"] = sellers["seller_type"].astype("category")

sellers["birthdate"].info()

<class 'pandas.core.series.Series'>
RangeIndex: 50 entries, 0 to 49
Series name: birthdate
Non-Null Count  Dtype
--------------  -----
50 non-null     datetime64[ns]
dtypes: datetime64[ns](1)
memory usage: 532.0 bytes

In [49]:
for x in sellers.columns:
    value_count_sellers = sellers[x].value_counts()
    duplicated_sellers = value_count_sellers[value_count_sellers > 1]
    print(duplicated_sellers)

Series([], Name: count, dtype: int64)
Series([], Name: count, dtype: int64)
Series([], Name: count, dtype: int64)
country
Germany        13
France         11
Spain           9
Belgium         5
Italy           4
Netherlands     4
Portugal        3
Name: count, dtype: int64
seller_type
indépendant         18
marketplace         17
maison d'édition    15
Name: count, dtype: int64

In [50]:
sellers["country"].unique()

['Spain', 'Germany', 'France', 'Netherlands', 'Italy', 'Belgium', 'Portugal', 'Luxembourg']
Categories (8, object): ['Belgium', 'France', 'Germany', 'Italy', 'Luxembourg', 'Netherlands', 'Portugal', 'Spain']

In [51]:
sellers["seller_type"].unique()

['indépendant', 'marketplace', 'maison d'édition']
Categories (3, object): ['indépendant', 'maison d'édition', 'marketplace']

In [52]:
# Cleaning the TRANSACTIONS table

transactions.head()

,transaction_id,book_id,buyer_id,price_paid,discount_rate,date
0,1,0312262ecafa5a40,1862,13.99,0.00,2026-11-13
1,2,a34ba96d4081e6a4,157,33.27,0.05,2019-04-17
2,3,30a7f60cd76ca58c,1925,18.59,0.10,2021-11-30
3,4,a897fe39b1053632,875,51.77,0.00,2020-05-30
4,5,0312262ecafa5a40,129,13.99,0.00,2022-01-17

In [53]:
transactions.tail()

,transaction_id,book_id,buyer_id,price_paid,discount_rate,date
14275,14276,AkxZFWNVpOJVzIdx,1603,51.77,0.0,2021-07-17
14276,14277,ce6396b0f23f6ecc,2721,NaN,0.0,2017-03-28
14277,14278,ce6396b0f23f6ecc,204,17.46,0.0,2019-04-05
14278,14279,1dfe412b8ac00530,2731,52.15,0.0,2019-06-21
14279,14280,3b1c02bac2a429e6,1545,52.29,0.0,2019-09-09

In [54]:
transactions.shape

(14280, 6)

In [55]:
transactions.info()

# price_paid has null values !

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14280 entries, 0 to 14279
Data columns (total 6 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   transaction_id  14280 non-null  int64
 1   book_id         14280 non-null  object
 2   buyer_id        14280 non-null  int64
 3   price_paid      14177 non-null  float64
 4   discount_rate   14280 non-null  float64
 5   date            14280 non-null  object
dtypes: float64(2), int64(2), object(2)
memory usage: 669.5+ KB

In [56]:
transactions.describe()

# price_paid has negative values (credit note ?)

       transaction_id      buyer_id    price_paid  discount_rate
count    14280.000000  14280.000000  14177.000000   14280.000000
mean      7140.500000   1489.743978     32.437048       0.032829
std       4122.425257    870.932181     15.911298       0.067498
min          1.000000      1.000000    -53.740000       0.000000
25%       3570.750000    725.750000     17.930000       0.000000
50%       7140.500000   1504.000000     31.520000       0.000000
75%      10710.250000   2245.000000     50.100000       0.000000
max      14280.000000   3000.000000     53.740000       0.250000

In [57]:
transactions.dtypes

transaction_id      int64
book_id            object
buyer_id            int64
price_paid        float64
discount_rate     float64
date               object
dtype: object

In [58]:
transactions["transaction_id"] = transactions["transaction_id"].astype("object")
transactions["buyer_id"] = transactions["buyer_id"].astype("object")
transactions["date"] = pd.to_datetime(transactions["date"], errors="coerce")

transactions["date"].info()

<class 'pandas.core.series.Series'>
RangeIndex: 14280 entries, 0 to 14279
Series name: date
Non-Null Count  Dtype
--------------  -----
14280 non-null  datetime64[ns]
dtypes: datetime64[ns](1)
memory usage: 111.7 KB

In [59]:
for x in transactions.columns:
    print(x, transactions[x].nunique())

transaction_id 14280
book_id 103
buyer_id 2985
price_paid 94
discount_rate 5
date 2971

In [60]:
for x in transactions.columns:
    print(x, transactions[x].isnull().sum())

# 103 records in the column price_parid are null values

transaction_id 0
book_id 0
buyer_id 0
price_paid 103
discount_rate 0
date 0

In [61]:
transactions.head()

,transaction_id,book_id,buyer_id,price_paid,discount_rate,date
0,1,0312262ecafa5a40,1862,13.99,0.00,2026-11-13
1,2,a34ba96d4081e6a4,157,33.27,0.05,2019-04-17
2,3,30a7f60cd76ca58c,1925,18.59,0.10,2021-11-30
3,4,a897fe39b1053632,875,51.77,0.00,2020-05-30
4,5,0312262ecafa5a40,129,13.99,0.00,2022-01-17

In [62]:
transactions = transactions[transactions["price_paid"] > 0]
transactions["price_paid"].unique()

array([13.99, 33.27, 18.59, 51.77, 33.34, 52.29, 16.14, 53.74, 17.46,
       52.15, 48.37, 50.1 , 20.66, 17.93, 39.22, 13.1 , 46.59, 44.45,
       25.01, 35.02, 15.24, 22.6 , 49.54, 31.52, 22.65, 46.94, 38.83,
       29.77, 13.45, 44.33, 45.68, 19.21, 42.58, 11.89, 20.34, 14.84,
       45.09, 19.25, 10.49, 13.29, 47.06, 15.71, 49.68, 40.3 , 20.38,
       37.58, 16.99, 19.63, 47.6 , 49.18, 15.5 , 12.59, 16.59, 28.34,
       17.56, 44.  , 39.11, 30.01, 31.67, 16.95, 26.26, 17.03, 21.52,
       51.05, 21.47])

In [63]:
# deleting all the irrelevant transactions that aren't related to the list of my books

transactions = transactions.merge(products, how="inner", left_on="book_id", right_on="book_id")

In [64]:
transactions["book_id"].unique()

array(['0312262ecafa5a40', 'a34ba96d4081e6a4', '30a7f60cd76ca58c',
       'a897fe39b1053632', '2597b5a345f45e1b', '3b1c02bac2a429e6',
       'e72a5dfc7e9267b2', '90fa61229261140a', 'ce6396b0f23f6ecc',
       '1dfe412b8ac00530', '6957f44c3847a760', 'e10e1e165dc8be4a',
       'f77dbf2323deb740'], dtype=object)

In [65]:
transactions.shape

(13988, 12)

In [66]:
transactions.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13988 entries, 0 to 13987
Data columns (total 12 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   transaction_id  13988 non-null  object
 1   book_id         13988 non-null  object
 2   buyer_id        13988 non-null  object
 3   price_paid      13988 non-null  float64
 4   discount_rate   13988 non-null  float64
 5   date            13988 non-null  datetime64[ns]
 6   name            13988 non-null  object
 7   price           13988 non-null  float64
 8   category        13988 non-null  category
 9   summary         13988 non-null  object
 10  rating          13988 non-null  category
 11  seller_id       13988 non-null  int64
dtypes: category(2), datetime64[ns](1), float64(3), int64(1), object(5)
memory usage: 1.1+ MB

In [67]:
transactions["price_paid"] = transactions["price"]

In [68]:
list = ["name", "price", "category", "summary", "rating", "seller_id"]

for x in list:
    transactions = transactions.drop(x, axis=1)

In [69]:
transactions = transactions.rename(columns={"price_paid":"price"})

In [70]:
transactions.insert(4, "price_paid", transactions["price"] - (transactions["price"] * transactions["discount_rate"]))
transactions["price_paid"] = transactions["price_paid"].round(2)

In [71]:
transactions.head()

,transaction_id,book_id,buyer_id,price,price_paid,discount_rate,date
0,1,0312262ecafa5a40,1862,13.99,13.99,0.00,2026-11-13
1,2,a34ba96d4081e6a4,157,35.02,33.27,0.05,2019-04-17
2,3,30a7f60cd76ca58c,1925,20.66,18.59,0.10,2021-11-30
3,4,a897fe39b1053632,875,51.77,51.77,0.00,2020-05-30
4,5,0312262ecafa5a40,129,13.99,13.99,0.00,2022-01-17

In [72]:
transactions.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13988 entries, 0 to 13987
Data columns (total 7 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   transaction_id  13988 non-null  object
 1   book_id         13988 non-null  object
 2   buyer_id        13988 non-null  object
 3   price           13988 non-null  float64
 4   price_paid      13988 non-null  float64
 5   discount_rate   13988 non-null  float64
 6   date            13988 non-null  datetime64[ns]
dtypes: datetime64[ns](1), float64(3), object(3)
memory usage: 765.1+ KB

In [73]:
is_unique_buyer_id = buyers["buyer_id"].is_unique
print("buyer_id :", is_unique_buyer_id) 
is_unique_book_id = products["book_id"].is_unique
print("book_id :", is_unique_book_id)
is_unique_review_id = reviews["review_id"].is_unique
print("review_id :", is_unique_review_id)
is_unique_seller_id = sellers["seller_id"].is_unique
print("seller_id :", is_unique_seller_id)
is_unique_transaction_id = transactions["transaction_id"].is_unique
print("transaction_id :", is_unique_transaction_id)

buyer_id : True
book_id : True
review_id : True
seller_id : True
transaction_id : True

In [ ]:
missing_values_transactions_book_id_fkey = transactions[~transactions["book_id"].isin(products["book_id"])]
print(f"FK book_id missing in transactions: {len(missing_values_transactions_book_id_fkey)}")
missing_values_transactions_buyer_id_fkey = transactions[~transactions["buyer_id"].isin(buyers["buyer_id"])]
print(f"FK buyer_id missing in transactions: {len(missing_values_transactions_buyer_id_fkey)}")
missin_values_reviews_book_id_fkey2 = reviews[~reviews["book_id"].isin(products["book_id"])]
print(f"FK book_id missing in reviews: {len(missin_values_reviews_book_id_fkey2)}")

FK book_id missing in transactions: 0
FK buyer_id missing in transactions: 0
FK book_id missing in reviews: 0

In [79]:
# both = match in both tables 
# left_only = exists in transactions but not in products (foreign key absent)
# right_only = exists in products but not in transactions

merged = transactions.merge(products, how="left", on="book_id", indicator=True)
merged[merged["_merge"] == "left_only"]

Empty DataFrame
Columns: [transaction_id, book_id, buyer_id, price_x, price_paid, discount_rate, date, name, price_y, category, summary, rating, seller_id, _merge]
Index: []

In [80]:
merged = transactions.merge(buyers, how="left", on="buyer_id", indicator=True)
merged[merged["_merge"] == "left_only"]

Empty DataFrame
Columns: [transaction_id, book_id, buyer_id, price, price_paid, discount_rate, date, name, gender, birthdate, country, customer_type, _merge]
Index: []

In [81]:
merged = reviews.merge(products, how="left", on="book_id", indicator=True)
merged[merged["_merge"] == "left_only"]

Empty DataFrame
Columns: [review_id, book_id, review_text, rating_x, review_date, author, name, price, category, summary, rating_y, seller_id, _merge]
Index: []

In [ ]:
buyers.to_csv("results_python/buyers.csv", index=False)
products.to_csv("results_python/products.csv", index=False)
reviews.to_csv("results_python/reviews.csv", index=False)
sellers.to_csv("results_python/sellers.csv", index=False)
transactions.to_csv("results_python/transactions.csv", index=False)